//
// Created by 赵烁文 on 2023/1/15.
//

#ifndef MYCPROJECT_STACK_H
#define MYCPROJECT_STACK_H

#endif //MYCPROJECT_STACK_H
/*****************************************************************************************************
 * 由于C++编译器支持重载，函数名称会做一些处理，而在c中仅是简单函数名，这里定义为了告诉c++编译器按照C语言的方式编译即可*
 *****************************************************************************************************/
#ifdef __cplusplus
extern "C"
{
#endif

/**
 * 类似于java Stack功能
 */









#ifdef __cplusplus
};
#endif
